/* 
Создайте 3 переменных ( x = 6, y = 14, z = 4 ) 
Выполните и отобразите результат следующих операций для этих переменных:
    x += y - x++ * z ;
    z = --x - y * 5 ;
    y /= x + 5 % z;
    z - x++ + y * 5;
    x = y - x++ * z;
Дайте ответ как джаваскрипт выполнил расчет каждой операции.
*/

var x = 6;
var y = 14;
var z = 4;

// Первое уравнение 
x += y - x++ * z;
/*
    1. 6*4 = 24
    2. 14-24 = -10
    3. 6 - 10 = -4
    4. x = 7
*/
document.write('<p>1. x += y - x++ * z;</p>');
document.write('<p> x = ' + x + '</p>');

// Второе уравнение 
x = 6;
y = 14; 
z = 4; 

z = --x - y * 5;

/*
    1. 14 * 5 = 70
    2. x = 5;
    3. 5 - 70 = -65
*/
document.write('<p>2. z = --x - y * 5;</p>');
document.write('<p> z = ' + z + '</p>');

// Третье уравнение 
x = 6;
y = 14; 
z = 4; 

y /= x + 5 % z;

/* 
    1. 5 % 4 = 1
    2. 6 + 1 = 7
    3. 14 / 7 = 2
*/

document.write('<p>3. y /= x + 5 % z;</p>');
document.write('<p> y = ' + y + '</p>');

// Четвертое уравнение
x = 6;
y = 14; 
z = 4; 

result = z - x++ + y * 5; 

/*
    1. 14 * 5 = 70
    2. 4 - 6 = -2
    3. -2 + 70 = 68
    4. x = 7
*/

document.write('<p>4. z - x++ + y * 5; </p>');
document.write('<p> result = ' + result + '</p>');

// Пятое уравнение 
x = 6;
y = 14; 
z = 4; 

x = y - x++ * z;

/*
    1. 6 * 4 = 24
    2. 14 - 24 = -10
    3. x = 7
*/
document.write('<p>5. x = y - x++ * z; </p>');
document.write('<p> x = ' + x + '</p>');